---
kind: type
id: T:Autodesk.Revit.DB.ICentralLockedCallback
source: html/ed94c7da-d506-5d51-d261-306c3a2a69a6.htm
---
# Autodesk.Revit.DB.ICentralLockedCallback

An interface that may be used to control Revit's behavior when it tries to lock central
 and is blocked because another user already has locked central.

## Syntax (C#)
```csharp
public interface ICentralLockedCallback
```